final_submission/app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ?  [["user_id", 1]]
---
	def index
		@tasks = current_user.tasks.all #returns an active record relation