final_submission/app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks"
---
	def index
		@tasks = Task.all #returns an active record relation

INSERT INTO "tasks" ("title", "details", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "Gsgsr"], ["details", "esfsef"], ["created_at", "2019-01-24 17:47:26.641579"], ["updated_at", "2019-01-24 17:47:26.641579"], ["user_id", 5]]
---
	def create
		@task = Task.new(task_params)
		@task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def edit
		@task = Task.find(params[:id]) #find the specific task with that id

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "tasks" SET "details" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["details", "Yes\r\nWill delete now"], ["updated_at", "2019-01-23 10:47:47.302071"], ["id", 8]]
---
	def update
		@task = Task.find(params[:id])
		@task.update(task_params)