final_submission/app/helpers/tasks_helper.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
	def current_user
		#if no user, dont find user
		User.find(session[:user_id]) if session[:user_id]