app/views/tasks/index.html.erb

	<%# For every 'f', create a checkbox %>
	<%= f.collection_check_boxes :id_in, current_user.tasks.all, :id, :title do |b| %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1  [["user_id", 1]]