app/views/users/index.html.erb

SELECT "users".* FROM "users"
---
						<tbody>
							<% @users.sort_by{ |user| [user.username, user.role] }.each do |user| %>