app/views/users/show.html.erb

				<h2><%= 'Search for tasks' %></h2>
				<% @search = @user.tasks.search(params[:q]) %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1  [["user_id", 2]]