app/controllers/tasks_controller.rb

SELECT DISTINCT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 AND "tasks"."id" IN (4)  [["user_id", 1]]
---
	def index
		if check_admin
			@search = Task.search(params[:q])
			@tasks = @search.result(distinct: true)
		else
			@search = current_user.tasks.search(params[:q])