app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks"
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ?  [["user_id", 1]]
---
	def index
		if check_admin
			@tasks = Task.all
		else
			@tasks = current_user.tasks.all #returns an active record relation

INSERT INTO "tasks" ("title", "details", "created_at", "updated_at", "user_id", "deadline") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "This should get destroyed"], ["details", ""], ["created_at", "2019-01-26 12:00:54.641654"], ["updated_at", "2019-01-26 12:00:54.641654"], ["user_id", 9], ["deadline", "2019-01-26"]]
---
	def create
		@task = current_user.tasks.build(task_params)
		if params[:cancel] || @task.save #short circuit, if either cancel or save.
			redirect_to tasks_path #redirects user to main task page (tasks#index)

UPDATE "tasks" SET "deadline" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["deadline", "2021-01-09"], ["updated_at", "2019-01-26 10:03:57.771470"], ["id", 2]]
---
	def update
		if params[:cancel] || @task.update(task_params)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
	def load_task
		@task = Task.find(params[:id])