app/controllers/users_controller.rb

	def create
		# If user creation or edit is cancelled, send admins back to users page and non-admins to main page
		if params[:cancel]
			check_admin ? redirect_to users_path : redirect_to root_path
		else
			@user = User.new(user_params)
			respond_to do |format|
				if @user.save
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "Q"], ["password_digest", "$2a$10$GLt1GaUVm64scdlLF8/kZe49tWoH7Ahs2E7giT5Nwa.7dzcKIzeda"], ["created_at", "2019-01-25 14:42:51.768772"], ["updated_at", "2019-01-25 14:42:51.768772"]]

	def update
		if params[:cancel]
			redirect_to root_path
		else
			respond_to do |format|
				if @user.update(user_params)
---
UPDATE "users" SET "role" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["role", "Tester"], ["updated_at", "2019-01-27 03:21:32.388583"], ["id", 2]]

	def destroy
		if !check_admin
    	@user.destroy
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 4]]