app/controllers/users_controller.rb

	def destroy
		if !check_admin
    	@user.destroy
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 4]]